import Note from '#models/note'
import { BaseSeeder } from '@adonisjs/lucid/seeders'

export default class extends BaseSeeder {
  async run() {
    // Write your database queries inside the run method
    await Note.createMany([
      {
        title: "Hello AdonisJS",
        slug: "hello-adonisjs",
        visibility: "public",
        ownerId: 1,
        isShadow: false,
        description: "เบื้องหลังของการทำงาน (Under the hood) เมื่อ React Router จะถูกแปลงร่างให้กลายเป็นแท็ก <a> ธรรมดาๆ 100% เลยครับ! สิ่งที่ <Link> ทำต่างจาก <a> ปกติ มีแค่เรื่องของการเอา JavaScript ไปดักจับ Event การคลิก เพื่อไม่ให้เบราว์เซอร์ทำการรีเฟรชหน้าเว็บ (เพื่อให้เป็น SPA อย่างที่เราเคยคุยกัน) 1111111111111111",
        content: "เบื้องหลังของการทำงาน (Under the hood) เมื่อ React Router ทำการประมวลผล (Render) โค้ดลงบนหน้าจอของผู้ใช้ <Link> จะถูกแปลงร่างให้กลายเป็นแท็ก <a> ธรรมดาๆ 100% เลยครับ! สิ่งที่ <Link> ทำต่างจาก <a> ปกติ มีแค่เรื่องของการเอา JavaScript ไปดักจับ Event การคลิก เพื่อไม่ให้เบราว์เซอร์ทำการรีเฟรชหน้าเว็บ (เพื่อให้เป็น SPA อย่างที่เราเคยคุยกัน) แต่ในเชิงของ CSS และ Layout มันคือ <a> ที่เป็น inline เหมือนกันเป๊ะครับ เบื้องหลังของการทำงาน (Under the hood) เมื่อ React Router ทำการประมวลผล (Render) โค้ดลงบนหน้าจอของผู้ใช้ <Link> จะถูกแปลงร่างให้กลายเป็นแท็ก <a> ธรรมดาๆ 100% เลยครับ! สิ่งที่ <Link> ทำต่างจาก <a> ปกติ มีแค่เรื่องของการเอา JavaScript ไปดักจับ Event การคลิก เพื่อไม่ให้เบราว์เซอร์ทำการรีเฟรชหน้าเว็บ (เพื่อให้เป็น SPA อย่างที่เราเคยคุยกัน) แต่ในเชิงของ CSS และ Layout มันคือ <a> ที่เป็น inline เหมือนกันเป๊ะครับ เบื้องหลังของการทำงาน (Under the hood) เมื่อ React Router ทำการประมวลผล (Render) โค้ดลงบนหน้าจอของผู้ใช้ <Link> จะถูกแปลงร่างให้กลายเป็นแท็ก <a> ธรรมดาๆ 100% เลยครับ! สิ่งที่ <Link> ทำต่างจาก <a> ปกติ มีแค่เรื่องของการเอา JavaScript ไปดักจับ Event การคลิก เพื่อไม่ให้เบราว์เซอร์ทำการรีเฟรชหน้าเว็บ (เพื่อให้เป็น SPA อย่างที่เราเคยคุยกัน) แต่ในเชิงของ CSS และ Layout มันคือ <a> ที่เป็น inline เหมือนกันเป๊ะครับ",
      },
      {
        title: "แนะนำ Frontend",
        slug: "frontend",
        visibility: "public",
        ownerId: 1,
        isShadow: false,
        content: "เบื้องหลังของการทำงาน (Under the hood) เมื่อ React Router ทำการประมวลผล (Render) โค้ดลงบนหน้าจอของผู้ใช้ <Link> จะถูกแปลงร่างให้กลายเป็นแท็ก <a> ธรรมดาๆ 100% เลยครับ! สิ่งที่ <Link> ทำต่างจาก <a> ปกติ มีแค่เรื่องของการเอา JavaScript ไปดักจับ Event การคลิก เพื่อไม่ให้เบราว์เซอร์ทำการรีเฟรชหน้าเว็บ (เพื่อให้เป็น SPA อย่างที่เราเคยคุยกัน) แต่ในเชิงของ CSS และ Layout มันคือ <a> ที่เป็น inline เหมือนกันเป๊ะครับ เบื้องหลังของการทำงาน (Under the hood) เมื่อ React Router ทำการประมวลผล (Render) โค้ดลงบนหน้าจอของผู้ใช้ <Link> จะถูกแปลงร่างให้กลายเป็นแท็ก <a> ธรรมดาๆ 100% เลยครับ! สิ่งที่ <Link> ทำต่างจาก <a> ปกติ มีแค่เรื่องของการเอา JavaScript ไปดักจับ Event การคลิก เพื่อไม่ให้เบราว์เซอร์ทำการรีเฟรชหน้าเว็บ (เพื่อให้เป็น SPA อย่างที่เราเคยคุยกัน) แต่ในเชิงของ CSS และ Layout มันคือ <a> ที่เป็น inline เหมือนกันเป๊ะครับ เบื้องหลังของการทำงาน (Under the hood) เมื่อ React Router ทำการประมวลผล (Render) โค้ดลงบนหน้าจอของผู้ใช้ <Link> จะถูกแปลงร่างให้กลายเป็นแท็ก <a> ธรรมดาๆ 100% เลยครับ! สิ่งที่ <Link> ทำต่างจาก <a> ปกติ มีแค่เรื่องของการเอา JavaScript ไปดักจับ Event การคลิก เพื่อไม่ให้เบราว์เซอร์ทำการรีเฟรชหน้าเว็บ (เพื่อให้เป็น SPA อย่างที่เราเคยคุยกัน) แต่ในเชิงของ CSS และ Layout มันคือ <a> ที่เป็น inline เหมือนกันเป๊ะครับ",
      },
      {
        title: "test",
        slug: "test",
        visibility: "private",
        ownerId: 2,
        isShadow: true
      },
      {
        title: "test1",
        slug: "test1",
        visibility: "public",
        ownerId: 1,
        isShadow: false,
        description: "เบื้องหลังของการทำงาน (Under the hood) เมื่อ React Router จะถูกแปลงร่างให้กลายเป็นแท็ก <a> ธรรมดาๆ 100% เลยครับ! สิ่งที่ <Link> ทำต่างจาก <a> ปกติ มีแค่เรื่องของการเอา JavaScript ไปดักจับ Event การคลิก เพื่อไม่ให้เบราว์เซอร์ทำการรีเฟรชหน้าเว็บ (เพื่อให้เป็น SPA อย่างที่เราเคยคุยกัน) 1111111111111111",
        content: "เบื้องหลังของการทำงาน (Under the hood) เมื่อ React Router ทำการประมวลผล (Render) โค้ดลงบนหน้าจอของผู้ใช้ <Link> จะถูกแปลงร่างให้กลายเป็นแท็ก <a> ธรรมดาๆ 100% เลยครับ! สิ่งที่ <Link> ทำต่างจาก <a> ปกติ มีแค่เรื่องของการเอา JavaScript ไปดักจับ Event การคลิก เพื่อไม่ให้เบราว์เซอร์ทำการรีเฟรชหน้าเว็บ (เพื่อให้เป็น SPA อย่างที่เราเคยคุยกัน) แต่ในเชิงของ CSS และ Layout มันคือ <a> ที่เป็น inline เหมือนกันเป๊ะครับ เบื้องหลังของการทำงาน (Under the hood) เมื่อ React Router ทำการประมวลผล (Render) โค้ดลงบนหน้าจอของผู้ใช้ <Link> จะถูกแปลงร่างให้กลายเป็นแท็ก <a> ธรรมดาๆ 100% เลยครับ! สิ่งที่ <Link> ทำต่างจาก <a> ปกติ มีแค่เรื่องของการเอา JavaScript ไปดักจับ Event การคลิก เพื่อไม่ให้เบราว์เซอร์ทำการรีเฟรชหน้าเว็บ (เพื่อให้เป็น SPA อย่างที่เราเคยคุยกัน) แต่ในเชิงของ CSS และ Layout มันคือ <a> ที่เป็น inline เหมือนกันเป๊ะครับ เบื้องหลังของการทำงาน (Under the hood) เมื่อ React Router ทำการประมวลผล (Render) โค้ดลงบนหน้าจอของผู้ใช้ <Link> จะถูกแปลงร่างให้กลายเป็นแท็ก <a> ธรรมดาๆ 100% เลยครับ! สิ่งที่ <Link> ทำต่างจาก <a> ปกติ มีแค่เรื่องของการเอา JavaScript ไปดักจับ Event การคลิก เพื่อไม่ให้เบราว์เซอร์ทำการรีเฟรชหน้าเว็บ (เพื่อให้เป็น SPA อย่างที่เราเคยคุยกัน) แต่ในเชิงของ CSS และ Layout มันคือ <a> ที่เป็น inline เหมือนกันเป๊ะครับ",
      },
      {
        title: "test2",
        slug: "test2",
        visibility: "public",
        ownerId: 2,
        isShadow: false,
        description: "เบื้องหลังของการทำงาน (Under the hood) เมื่อ React Router จะถูกแปลงร่างให้กลายเป็นแท็ก <a> ธรรมดาๆ 100% เลยครับ! สิ่งที่ <Link> ทำต่างจาก <a> ปกติ มีแค่เรื่องของการเอา JavaScript ไปดักจับ Event การคลิก เพื่อไม่ให้เบราว์เซอร์ทำการรีเฟรชหน้าเว็บ (เพื่อให้เป็น SPA อย่างที่เราเคยคุยกัน) 1111111111111111",
        content: "เบื้องหลังของการทำงาน (Under the hood) เมื่อ React Router ทำการประมวลผล (Render) โค้ดลงบนหน้าจอของผู้ใช้ <Link> จะถูกแปลงร่างให้กลายเป็นแท็ก <a> ธรรมดาๆ 100% เลยครับ! สิ่งที่ <Link> ทำต่างจาก <a> ปกติ มีแค่เรื่องของการเอา JavaScript ไปดักจับ Event การคลิก เพื่อไม่ให้เบราว์เซอร์ทำการรีเฟรชหน้าเว็บ (เพื่อให้เป็น SPA อย่างที่เราเคยคุยกัน) แต่ในเชิงของ CSS และ Layout มันคือ <a> ที่เป็น inline เหมือนกันเป๊ะครับ เบื้องหลังของการทำงาน (Under the hood) เมื่อ React Router ทำการประมวลผล (Render) โค้ดลงบนหน้าจอของผู้ใช้ <Link> จะถูกแปลงร่างให้กลายเป็นแท็ก <a> ธรรมดาๆ 100% เลยครับ! สิ่งที่ <Link> ทำต่างจาก <a> ปกติ มีแค่เรื่องของการเอา JavaScript ไปดักจับ Event การคลิก เพื่อไม่ให้เบราว์เซอร์ทำการรีเฟรชหน้าเว็บ (เพื่อให้เป็น SPA อย่างที่เราเคยคุยกัน) แต่ในเชิงของ CSS และ Layout มันคือ <a> ที่เป็น inline เหมือนกันเป๊ะครับ เบื้องหลังของการทำงาน (Under the hood) เมื่อ React Router ทำการประมวลผล (Render) โค้ดลงบนหน้าจอของผู้ใช้ <Link> จะถูกแปลงร่างให้กลายเป็นแท็ก <a> ธรรมดาๆ 100% เลยครับ! สิ่งที่ <Link> ทำต่างจาก <a> ปกติ มีแค่เรื่องของการเอา JavaScript ไปดักจับ Event การคลิก เพื่อไม่ให้เบราว์เซอร์ทำการรีเฟรชหน้าเว็บ (เพื่อให้เป็น SPA อย่างที่เราเคยคุยกัน) แต่ในเชิงของ CSS และ Layout มันคือ <a> ที่เป็น inline เหมือนกันเป๊ะครับ",
      },
      {
        title: "test3",
        slug: "test3",
        visibility: "public",
        ownerId: 1,
        isShadow: false,
        description: "เบื้องหลังของการทำงาน (Under the hood) เมื่อ React Router จะถูกแปลงร่างให้กลายเป็นแท็ก <a> ธรรมดาๆ 100% เลยครับ! สิ่งที่ <Link> ทำต่างจาก <a> ปกติ มีแค่เรื่องของการเอา JavaScript ไปดักจับ Event การคลิก เพื่อไม่ให้เบราว์เซอร์ทำการรีเฟรชหน้าเว็บ (เพื่อให้เป็น SPA อย่างที่เราเคยคุยกัน) 1111111111111111",
        content: "เบื้องหลังของการทำงาน (Under the hood) เมื่อ React Router ทำการประมวลผล (Render) โค้ดลงบนหน้าจอของผู้ใช้ <Link> จะถูกแปลงร่างให้กลายเป็นแท็ก <a> ธรรมดาๆ 100% เลยครับ! สิ่งที่ <Link> ทำต่างจาก <a> ปกติ มีแค่เรื่องของการเอา JavaScript ไปดักจับ Event การคลิก เพื่อไม่ให้เบราว์เซอร์ทำการรีเฟรชหน้าเว็บ (เพื่อให้เป็น SPA อย่างที่เราเคยคุยกัน) แต่ในเชิงของ CSS และ Layout มันคือ <a> ที่เป็น inline เหมือนกันเป๊ะครับ เบื้องหลังของการทำงาน (Under the hood) เมื่อ React Router ทำการประมวลผล (Render) โค้ดลงบนหน้าจอของผู้ใช้ <Link> จะถูกแปลงร่างให้กลายเป็นแท็ก <a> ธรรมดาๆ 100% เลยครับ! สิ่งที่ <Link> ทำต่างจาก <a> ปกติ มีแค่เรื่องของการเอา JavaScript ไปดักจับ Event การคลิก เพื่อไม่ให้เบราว์เซอร์ทำการรีเฟรชหน้าเว็บ (เพื่อให้เป็น SPA อย่างที่เราเคยคุยกัน) แต่ในเชิงของ CSS และ Layout มันคือ <a> ที่เป็น inline เหมือนกันเป๊ะครับ เบื้องหลังของการทำงาน (Under the hood) เมื่อ React Router ทำการประมวลผล (Render) โค้ดลงบนหน้าจอของผู้ใช้ <Link> จะถูกแปลงร่างให้กลายเป็นแท็ก <a> ธรรมดาๆ 100% เลยครับ! สิ่งที่ <Link> ทำต่างจาก <a> ปกติ มีแค่เรื่องของการเอา JavaScript ไปดักจับ Event การคลิก เพื่อไม่ให้เบราว์เซอร์ทำการรีเฟรชหน้าเว็บ (เพื่อให้เป็น SPA อย่างที่เราเคยคุยกัน) แต่ในเชิงของ CSS และ Layout มันคือ <a> ที่เป็น inline เหมือนกันเป๊ะครับ",
      }
    ])
  }
}